//  Size:           ?

class WheeledVehiclePhysicsAttributes
{
public:
    float m_fPlayerOpenDoorMaxAngle;     // 0x250
    float m_fPlayerOpenDoorDuration;     // 0x254
    float m_fPlayerOpenDoorFrame;        // 0x258
    float m_fPlayerCloseDoorFrame;       // 0x25C
    float m_fPlayerOpenDoorFrameExit;    // 0x260
    float m_fPlayerCloseDoorFrameExit;   // 0x264
    float m_fPlayerOpenDoorDurationExit; // 0x268
    bool m_bNoExitingAnimation;          // 0x26C
};