//  Size:           0x28

class FlowTime
{
public:   
    unsigned int uMicroseconds;                 // 0x0
    unsigned int uMilliseconds;                 // 0x4
    float fMilliseconds;                        // 0x8
    float fSeconds;                             // 0xC
    unsigned int m_Unknown4;                    // 0x10
    unsigned int m_Unknown5;                    // 0x14
    float fRawMilliseconds;                     // 0x18
    unsigned int m_Unknown7;                    // 0x1C
    unsigned int m_Unknown8;                    // 0x20
    unsigned int m_Unknown9;                    // 0x24
};