//  Size:           0x28

class FlowTime
{
public:   
    unsigned int m_Unknown0;                    // 0x0
    unsigned int m_Unknown1;                    // 0x4
    unsigned int m_Unknown2;                    // 0x8
    unsigned int m_Unknown3;                    // 0xC
    unsigned int m_Unknown4;                    // 0x10
    unsigned int m_Unknown5;                    // 0x14
    unsigned int m_Unknown6;                    // 0x18
    unsigned int m_Unknown7;                    // 0x1C
    unsigned int m_Unknown8;                    // 0x20
    unsigned int m_Unknown9;                    // 0x24
};