//  Size:           0x20

class renderer::FogParameters
{
public:
    float m_Unknown0;                       // 0x0
    float m_Unknown1;                       // 0x4
    float m_Unknown2;                       // 0x8
    float m_Unknown3;                       // 0xC
    float m_Unknown4;                       // 0x10
    float fogStart;                         // 0x14
    float fogEnd;                           // 0x18
    float m_Unknown5;                       // 0x1C
};
